Repository: fritids/surdiscount.com
Catalog: stats/locale/*/LC_MESSAGES/messages.po
Languages: it_it

source: Le dossier /install est encore present dans votre repertoire SpongeStats, veuillez le supprimer pour des raisons de securite
it_it: La cartella /install è encora nello repertorio SpongeStats, vuole rimouoverlo per ragioni di securita.

source: Graphiques
it_it: Grafiche

source: Pages
it_it: Pagine vista

source: Hotes
it_it: Ospiti

source: Referents
it_it: Referenti

source: Plateformes
it_it: Piattiformi

source: Mots-cles
it_it: Keywords

source: Administration
it_it: Amministrazione

source: Informations
it_it: Informazioni

source: Visiteurs de la journee
it_it: Visitori della giornata

source: Derniers visiteurs
it_it: Ultimi visitori

source: Documentation
it_it: Documentazione

source: Fil RSS de vos statistiques
it_it: Filo RSS dei statistici

source: Rechercher
it_it: Ricercare

source: Themes
it_it: Temi

source: Chargement de la page en cours
it_it: Caricamento della pagina in corso

source: Logiciel libre sous Licence GPL v2
it_it: Software libro con licenza GPL 2

source: Auteurs
it_it: Autori

source: Statistiques quotidiennes du
it_it: Statistici quotidianni del

source: Statistiques hebdomadaires du
it_it: Statistici settimanali del

source: Statistiques mensuelles du
it_it: Statistici mensuale del

source: Statistiques annuelles du
it_it: Statistici annuali del

source: Nombre de visiteurs
it_it: Numero dei visitori

source: Nombre de pages vues
it_it: Numero dei pagine vista

source: Meilleur site referent
it_it: Migliore sito riferento

source: Meilleure page referente
it_it: Migliore pagina riferenta

source: Connexion a la base impossible
it_it: Connezionne alla BDD impossiblile

source: Installer Spongestats
it_it: Installare SpongeStats

source: Creation table statistiques
it_it: Creazione tavola statistiche

source: Creation table archives
it_it: Creazione tavola archive

source: Creation table statistiques du mois
it_it: Creazione tavola statistche del meso

source: Creation table configuration
it_it: Creazione tavola configurazione

source: Entrez le mot de passe pour acceder a l'administration
it_it: Marca qui il password per l'amministrazione

source: Valider
it_it: Andiamo !

source: Le mot de passe a bien ete change
it_it: Il password era bene cambiato

source: Les donnees anterieures a la date selectionnee ont ete purgees
it_it: I dati anteriori stava bene rimuoverati

source: ATENTION: Ne faites des modifications dans les champs ci-dessous uniquement si vous savez ce que vous faites, tous les changements effecutes ne peuvent etre annules.
it_it: ATTENZIONNE : Non deve fare modificazione questo SOLTANTO se sa cio che fa, tutte cambie non puo se annnulare.

source: Configuration
it_it: Configurazione

source: Changement du mot de passe
it_it: Cambiamento del password

source: Purger les donnees
it_it: Rimuovere tutti dati

source: Exporter les donnees
it_it: Esportare i dati

source: Exclusions
it_it: Esclusioni

source: oui
it_it: Si

source: non
it_it: No

source: IP exclues
it_it: IP escluderati

source: Hote exclus
it_it: Ospiti escluderati

source: Referers exclus
it_it: Riferrenti escluderati

source: Logiciels exclus
it_it: Software escluderati

source: Interface et affichage
it_it: Interfaccia et visualizzazione

source: Langue par defaut
it_it: Lingua per default

source: Affichage de l'aide
it_it: Affissione del aituta

source: Theme par defaut
it_it: Temo per default

source: Nombre de visiteurs affiches
it_it: Numero delle visitori affissionni

source: Nombre de pages vues affichees
it_it: Numero delle pagine vista affissionni

source: Nombre de pages d'entree affichees
it_it: Numero delle pagine di entrada affissionni

source: Nombre de pages referers affichees
it_it: Numero delle pagine riferenti affissionni

source: Nombre de domaines referers affichees
it_it: Numero delle site riferenti affissionni

source: Nombre de mots cles affiches
it_it: Numero delle keywords affissionni

source: Nombre d'occurence des mots cles pour l'affichage
it_it: Numero delle occorrenze dei keywords per l'affissione

source: Nombre de jour pour l'evolution des mots cles
it_it: Numero del giorni per l'evoluzione dei keywords

source: Nombre d'ip affichees
it_it: Numero dei IP affssionni

source: Nombre d'hotes affiches
it_it: Numero dei ospiti affissionni

source: Afficher les favicon
it_it: Affissionare i "favicons"

source: Exclusions des domaines pour l'affichage des favicons
it_it: Escluzione dei siti per l'affissionne dei "Favicons"

source: Logiciels et plateformes
it_it: Software e Sistemi operativi

source: Navigateurs
it_it: Browsers

source: Agregateurs
it_it: Aggregatori

source: Systemes d'exploitation
it_it: Sistemi operativi

source: Modifier la configuration
it_it: Cambiare la configurazionne

source: Nouveau mot de passe
it_it: Nuove password

source: Confirmation
it_it: Confirmazzione

source: Changer le mot de passe
it_it: Cambiare il password

source: La purge des donnees vous permet d'alleger votre base de donnee. Toutes les informations de statistiques anterieures a la date que vous choisisirez seront perdues Si vous souhaitez reutiliser ces informations, faites d'abord un export de votre base.
it_it: Rimuovere i dati reduce il peso de la BDD. Tutti i informazzioni dei statistici anteriori sarà rimove. ATTENZIONNE !

source: Purger les donnees plus anciennes que
it_it: Rimuovere i dati più ancienna da

source: Aucune donnee a purger
it_it: Neanche date da rimuovere

source: L'export de donnee vous permet de faire une sauvegarde complete de vos donnees SpongeStats. L'export est au format .sql, vous pourrez ensuite reimporter ce fichier dans votre base de donnee a l'aide de votre outil de gestion de base MySQL (PHPMyAdmin, Eskuel, mysqladmin, etc...)
it_it: L'esporto dei dati permette de fare un backup dei tutti i dati SpongeStats. L'esporto è nel formatto SQL, lei puo importare archvio in una altra BDD de gestione MySQL (PHPMyAdmin, Eskuel, mysqladmin, etc...).

source: Archives mensuelles
it_it: Archivi mensualli

source: Archives des mots-cles
it_it: Archivi dei keywords

source: Archives des referents
it_it: Archivi dei riferenti

source: Archives des plate-formes
it_it: Archivi dei piattiformi

source: Archives des pages vues
it_it: Archivi dei pagine vista

source: Archives des pages d'entree
it_it: Archivi dei pagine d'entrata

source: Archives des noms d'hotes
it_it: Archivi dei ospiti

source: Aucune archive
it_it: Neanche archive

source: derniers visiteurs
it_it: Ultimi Visitori

source: Ce tableau affiche les derniers visiteurs ayant parcouru votre site. En cliquant sur l'icone a cote du nom d'hote, vous pourrez voir le detail de ce visiteur (adresse ip, referent, logiciel, date de premiere visite, etc...)
it_it: Questo tavolo appara i ultimi visitori che hanno accedato a tuo sito. Clicheva su l'icona in fronto a il nome d'ospiti, puoi vedere tutto su questo visitore : IP, riferente, browser, OS, data della prima visita, etc...

source: Hote
it_it: Ospiti

source: Pages vues
it_it: Pagine Vista

source: Plus de details
it_it: Mmmm, more details plz !

source: Nom d'hotes et adresses IP pour le mois
it_it: Ospiti e IP per il meso

source: Noms d'hotes
it_it: Nome di ospiti

source: Adresses IP
it_it: IPs

source: Plages horaires de frequentation
it_it: Orarie di frequentazionne

source: Ce graphique affiche la repartition horaire des visiteurs pour la periode en cours, l'heure de visite prise en compte est celle de la premiere visite de la journee.
it_it: Questo grafico montreve la repartizione horarie dei visitori per la perioda in corso , l'orario della visita stava la prima vsita della giornata.

source: Top %s des noms d'hotes
it_it: Top %s dei nome di ospiti

source: Les noms d'hotes sont les identifiants des fournisseurs d'acces des visiteurs s'etant connectes au site, ils sont classes par nombre de visites depuis cet hote pour la periode en cours
it_it: I nomi di ospiti sono l'identificazionne dei FAI dei visitori che si connectando al sito, sono nel ordine cronolologico

source: Top %s des adresses IP
it_it: Top %s dei IPs

source: Les adresses IP sont les numeros qui identifient chaque ordinateur connecte a Internet, les visiteurs de votre site sont indexes grace a cet identifiant unique. Elles sont classees par nombre de visites depuis cette adresse IP pour la periode en cours
it_it: Le indirizzo IP sono i numero che identificano tutti i computer su Internet, i visitori sono indexato con questo numero unico. Sono classato per ordine cronologico.

source: Top %s des Mots-cles
it_it: Top %s dei keyWords

source: Les mots cles sont les elements de la recherche qui ont permis a un visiteur d'arriver sur votre site. Ils sont classes par nombre de recherche depuis les differents moteurs disponible sur Internet. En cliquant sur l'icone a cote du mot, vous accederez a un lien permettant de faire une recherche sur plusieurs moteurs afin d'etudier votre positionnement pour un mot cle donne.Vous pourrez aussi voir l'evolution de ce mots cles sur les derniers jours.
it_it: Gli keywords sono gli elementi di un ricerca sur google per esempio che hanno permesso a un visitore di arrivare su vostro sito. Cliche su il nome, vuoi accedano a un link per vedere la ricerca che ha fatto il visitore.

source: Top %s des pages d'entree
it_it: Top %s dei pagine d'entrata

source: Les pages d'entree sont les premieres pages consultees par un visiteur lorsqu'il entre sur votre site. Elles sont classees par nombre de consultation pour la periode en cours.
it_it: Le pagine d'entrate sono le prime pagine che hanno visto il visitore quando è entrano nel vostro sito. Sono organsato per la perioda

source: Top %s des sites referents
it_it: Top %s dei siti riferenti

source: Les domaines referers sont les sites qui ont amenes des visiteurs sur votre site, ils sont classes par nombre de visiteurs qu'ils ont amenes. Les moteurs de recherche les plus utilises ne sont pas affiches dans cette liste.
it_it: I siti referenti sono i siti che hanno portato visitori in loro sito. I motori di ricerca i più famosi non sono affisonati in questo lista.

source: Top %s des pages referentes
it_it: Top %s dei pagine riferenti

source: Les pages referers sont les pages des sites qui ont amenes des visiteurs sur votre site, ils sont classes par nombre de visiteurs qu'ils ont amenes. Les moteurs de recherche les plus utilises ne sont pas affiches dans cette liste.
it_it: Le pagine riferente sono le pagine dei siti che hanno portato visitori nel vostro sito. Il famosi motori di ricerca non sono affisionati qui.

source: Acces direct
it_it: Acceso diretto

source: Moteurs de recherche
it_it: Motori di ricerca

source: Les moteurs de recherche sont les sites qui ont amenes des visiteurs sur votre site par une recherche par mot cle, ils sont classes par nombre de visiteurs qu'ils ont amenes. Les 100 premiers moteurs sont affiches.
it_it: I motori di ricerca sono siti che portano visitori con una ricerca con keywords. I centi motori piu famosi sono affisionati.

source: Les navigateurs sont les logiciels utilises par les visiteurs pour consulter votre site. Ils sont classes par nombre de consultation avec ce navigateur pour la periode en cours. Pour editer la liste des navigateurs pris en compte, veuillez vous reporter a la documentation
it_it: I browsers sono software che sono utilisato par i visitori per consultare vostro sito. Per conoscere i browsers che sono nel questo versionne, visita la documentazione (in francese)

source: Pas de donnees precises pour ce navigateur
it_it: Neanche dati per questo browser

source: Nombre de visites via un navigateur
it_it: Numero dei visite con un browser

source: Les agregateurs sont les logiciels utilises par les visiteurs pour consulter les fils d'informations disponible sur votre site. Ils sont classes par nombre de consultation avec cet agregateur pour la periode en cours, si vous n'avez pas de valeur dans cette partie, c'est surement que votre site ne propose pas de fil d'informations au format RSS ou ATOM. Pour editer la liste des agregateurs pris en compte, veuillez vous reporter a la documentation
it_it: I aggregatori sono software utilisato da i visitori per consultare i fili RSS di vostro sito. Se non hai niente in questo lista, cio che vostro sito non ha une filo RSS o ATOM.

source: Nombre de visites via un agregateur
it_it: Numero dei visiti via un aggregatore

source: Les systemes d'exploitation sont les plateformes utilises par les visiteurs pour consulter votre site. Ils sont classes par nombre de consultation avec ce systeme d'exploitation pour la periode en cours. Pour editer la liste des systemes d'exploitation pris en compte, veuillez vous reporter a la documentation
it_it: Un sistemo operativo e la piattaforma utilisata da i visitori per visitare vostro sito. Per vedere la lista dei sistemi operativi supportato da SS, visita la documentazione in francese

source: Chercher par nom d'hote
it_it: Chercare per il nome di ospite

source: Chercher par IP
it_it: Cercare per IP

source: Chercher par referer
it_it: Chercare per il riferenti

source: Mots-cles pour le mois
it_it: Keywords per il meso

source: Pages les plus vues pour le mois
it_it: Pagine più visto per il mesi

source: Pages d'entree
it_it: Pagine di entrata

source: Pages les plus vues
it_it: Pagine più visto

source: Plages horaires de frequentation pour
it_it: Orarie di frequentazione per

source: Plateformes pour le mois
it_it: Piattiformi per il meso

source: Adresse IP
it_it: Indirizzo IP

source: Referent
it_it: Rifirento

source: Logiciel
it_it: Software

source: Page d'entree
it_it: Pagina di entratta

source: Aujourd'hui
it_it: Oggi

source: Premiere visite
it_it: Prima visita

source: Visite precedente
it_it: Precedenta visita

source: Detail et evolution pour le mot cle %s
it_it: Evolutione per il keyword %s

source: Voir le positionnement dans
it_it: Vedere la posizzione in

source: Evolution sur les %s derniers jours
it_it: Evoluzzione dentro i %s giorni

source: L'evolution n'est pas disponible pour les donnees quotidiennes
it_it: L'evoluzzione non è disponiblile per i dati quotidianni

source: Derniers referents pour ce mot cle
it_it: Riferenti per il keyword

source: Les derniers referents ne sont disponibles pour les donnees quotidiennes
it_it: No, i riferenti non sono disponibile per i dati quotidianni

source: IP
it_it: IPd

source: Hits
it_it: Top

source: Aucune valeur enregistree pour l'
it_it: Neanche valore enregistrata per

source: Referents pour le mois
it_it: Riferenti per il meso

source: Domaines referents
it_it: Siti riferenti

source: Pages referentes
it_it: Pagine riferenti

source: Statistiques pour l'annee
it_it: Statistici per l'anno

source: Pages vues et Visiteurs uniques
it_it: Pagine viste e Visitore uniche

source: Nombre de visiteurs total
it_it: Numero di visitori tottali

source: Nombre de pages vues total
it_it: Numero di pagine vista

source: Nombre de visiteurs maximum
it_it: Numero di visitori maximali

source: Nombre de pages vues maximum
it_it: Numero di pagine vista maximali

source: Moyenne du nombre de visiteurs
it_it: Moyenna dei visitori

source: Moyenne du nombre de pages vues par visiteur
it_it: Moyenna dei pagine viste per uno visitore

source: Visiteurs
it_it: Visitori

source: Statistiques du
it_it: Statistici del

source: Voir les statistiques horaires
it_it: Vedere i statistici orarie

source: Voir les hotes
it_it: Vedere i ospiti

source: Voir les IP
it_it: Vedere i IP

source: Voir les domaines referents
it_it: Vedere i siti riferenti

source: Voir les pages referentes
it_it: Vedere le pagine riferente

source: Voir les pages d'entree
it_it: Vedere le pagine di entrata

source: Voir les navigateurs
it_it: Vedere i browsers

source: Voir les agregateurs
it_it: Vedere I aggregatori

source: Voir les systemes d'exploitation
it_it: Vedere i sistemi operativi

source: Voir les mots cles
it_it: Vedere i keywords

source: Janvier
it_it: Gennaio

source: Fevrier
it_it: Febbraio

source: Mars
it_it: Marzo

source: Mai
it_it: Maggio

source: Juin
it_it: Giugnio

source: Juillet
it_it: Luglio

source: Aout
it_it: Agosto

source: Septembre
it_it: Settembre

source: Octobre
it_it: Ottobre

source: Decembre
it_it: Dicembre

source: Statistiques de
it_it: Statistici dal

source: Voir les statistiques globales pour l'annee
it_it: Vedere i statistici globali per l'anno

source: Voir les statistiques de frequentation
it_it: Vedere i statistici di frequentazione

source: Statistiques de frequentation
it_it: Statistici di frequentazione

source: Ce graphique affiche le nombre de visiteurs et de pages vues pour la periode en cours, cliquez sur les barres ou sur le chiffre pour obtenir le detail des visiteurs pour cette journee.
it_it: Questo grafico montreva il numero dei visitori e dei pagine viste per la perioda in corso, cliche su i barru o su i numeri per otteniere il detaillo dei visitori per l'anno.

source: Impossible de verifier les mises a jour
it_it: Impossibile di verificare updates

source: Votre version est a jour
it_it: Tuo versione stava a giono

source: Une nouvelle version est disponible
it_it: Una nuova versione stava disponiblie
